<a href="https://colab.research.google.com/github/Krishna101211/PANDAS/blob/main/8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
# alphabets=['A','B','C','D']
# number=[1,2,3,4]
# data={'name':alphabets,'number':number}
# df=pd.DataFrame(data)
# print(df)

  name  number
0    A       1
1    B       2
2    C       3
3    D       4

#**loc**

In [ ]:
#it is one of the property
#loc()it act like get index position included
#in loc() we work on columnname
# iloc() index postion exclude we need only mention position it work like take()

In [ ]:
emp_name=['a','b','c','d','e']
#emp_id=[1,2,3,4,5]
SAL=[100,200,2000,3000,4000]
loc=['pune','delhi','banglore','mumbai']
data={"sal":SAL,"loc":loc}

In [ ]:
x=pd.DataFrame(zip(emp_name,SAL,loc))
print(x)
print()
#data_frame.loc[row_number]
print(x.loc[1])

   0     1         2
0  a   100      pune
1  b   200     delhi
2  c  2000  banglore
3  d  3000    mumbai

0        b
1      200
2    delhi
Name: 1, dtype: object

In [ ]:
#data_frame.loc[[row_number,row_number1]] for multiple row
print(x.loc[[0,1]])

   0    1      2
0  a  100   pune
1  b  200  delhi

In [ ]:
#data_frame.loc[row_number,[column_name,,,]]
# print(x.loc[1,[sal]])
# print(x.loc[1,['loc',"sal"]])

In [ ]:
#data_fram.loc[start:stop]
print(x[0:3:1])
print()
print()

   0     1         2
0  a   100      pune
1  b   200     delhi
2  c  2000  banglore

In [ ]:
#data_fram.loc[start:stop,"column_name"]
print(x.loc[0:1,sal])

In [ ]:
#data_fram.loc[start:stop,"col_name1":"column_n"]

#**iloc**

In [ ]:
#we working on colmn position
#iloc is also property
#no need to mention columname

In [ ]:
#data_frame[row_number,column_number]

In [ ]:
print(x.iloc[0,1])

100

In [ ]:
#data_frame[row_start:row_stop,col_start:col_stop]
#data_frame.iloc[start:stop,column_number]
#data_frame.iloc[[row_1,row2]]

In [ ]:
print(x.iloc[0:3,0:2])

   0     1
0  a   100
1  b   200
2  c  2000

In [ ]:
print(x.iloc[0:3,2])

0        pune
1       delhi
2    banglore
Name: 2, dtype: object

In [ ]:
print(x.iloc[[1,2]])

   0     1         2
1  b   200     delhi
2  c  2000  banglore

#**insert**

In [ ]:
x.insert(1,"AGE",[10,20,30,40])
print(x)

   0  AGE     1         2
0  a   10   100      pune
1  b   20   200     delhi
2  c   30  2000  banglore
3  d   40  3000    mumbai

In [ ]:
print(x.assign(T=[10,20,30,40],T1=[11,201,301,401]))
print()
print(x)

   0  AGE     1         2   T   T1
0  a   10   100      pune  10   11
1  b   20   200     delhi  20  201
2  c   30  2000  banglore  30  301
3  d   40  3000    mumbai  40  401

   0  AGE     1         2
0  a   10   100      pune
1  b   20   200     delhi
2  c   30  2000  banglore
3  d   40  3000    mumbai

In [ ]:
# print(x['SAL'].astype(float))

In [ ]:
# print(x.drop("SAL",axis=1)) #when deleting column mention the axis number

In [ ]:
#pop